{
	"Info":
	{
		"name":"Vatsal Vora",
		"desc":"Data Engineer",
		"email":"vatsalajvora@gmail.com",
		"linkedin":"https://www.linkedin.com/in/vatsal-vora/",
		"github":"https://www.github.com/vatsalvora"
	},
	"Summary": ["Software Engineering Professional with a strong academic background and industry experience working in US and India. Quick learner with an insatiable appetite for learning new technical skills. Experience working in a startup and corporate environment. Developed applications on mobile and web platforms. Experienced in developing Cloud based solutions. Strong analytic and technical problem solving skills."],
	"Experience":[
		{
			"company":"Evernorth",
			"location":"(Remote) Tampa, FL",
			"title":"Software Engineering Senior Advisor",
			"dates":"Nov 2020 - Present",
			"desc":"Created processes to establish Data Access Controls using Databricks,Delta Lake, AWS IAM, and Okta. Created an Angular Dashboard using S3 static web hosting, serverless lambda (python) APIs, AWS Batch, API Gateway, and Okta to give insights into Third-Party Data Exchange at Cigna. Created a Data Quality application using AWS, Terraform,Databricks, Delta Lake, and Tableau. Ran Spark Jobs for Data profiling and certification on a Databricks cluster and data in Delta Lake tables. Created Data Visualizations using Tableau backed by data in Delta Lake tables."
		},
		{
			"company":"The Nielsen Company",
			"location":"Tampa, FL",
			"title":"Software Developer",
			"dates":"Sept 2017 - Nov 2020",
			"desc":"Orchestrated a Data Pipeline using Apache airflow, AWS Step Functions, AWS DataPipeline, and AWS Lambda. Organized Spark jobs for data ingestion from s3 to Elasticsearch, spring batch jobs to ingest data from legacy databases, and machine learning processes with TensorFlow in the Data Pipeline. Wrote spark jobs for data ingestion from S3 to Cassandra and Elasticsearch. Received Simply Excellent Gold award for working with positive philosophy, acting quickly to eliminate wastage of cloud resources. Created Cassandra and Elasticsearch clusters. Set up backup and restore processes for Elasticsearch and Cassandra. Worked on reducing cloud costs by scheduling weekend shutdowns resulting in savings of 92% for weekend cloud spend. Received Simply Excellent Gold award for “Cost savings”. Created DevOps CI/CD pipeline with Jenkins. Created deployment scripts with Ansible and Terraform to AWS Cloud. Designed and developed an application to manage and monitor a Hazelcast Cluster using a React frontend and Spring Boot Microservice backend. The application resulted in projected costs savings of $1 Million in licensing fees. Received Simply Excellent Gold award for going above and beyond planned commitments and taking up a stretch goal."
		},
		{
			"company":"JPMorgan Chase",
			"location":"Tampa, FL",
			"title":"Summer Technology Analyst Application Developer",
			"dates":"June 2014 - Aug 2014",
			"desc":"Worked on the Automated Clearing House payments project. Configured a Continuous Integration Server with Jenkins to alert the development team when a bad commit to a Subversion repository broke the build. Configured a Maven build for a multi-modal project. Wrote Scripts for three different Operating Systems (Windows, Unix and Mainframe). Performed regression testing on multiple Java applications."
		},
		{
			"company":"Sears Holding Corporation [MetaScale]",
			"location":"San Jose, CA",
			"title":"Analytics Applications Engineer Intern",
			"dates":"June 2013 - Aug 2013",
			"desc":"Developed a real time analytics application using predictive modeling to analyze and predict trends in the incoming high volume data flow of retail revenue. Developed the application using Java J2EE, Teradata, MongoDB, and open source libraries such as Apache Maven, Storm, Trident and Kafka."
		}
	],
	"Education": [
		{
			"degree": "Post Graduate Degree in Philosophy",
			"institution": "Tattvajnana Vidyapeeth",
			"dates": "August 2015 - April 2017"
		},
		{
			"degree": "Master's in Computer Science",
			"institution": "University of Florida",
			"dates": "August 2014 - May 2015"
		},
		{
			"degree": "Bachelor's in Computer Science Engineering",
			"institution": "University of Florida",
			"dates": "Aug 2011 - Dec 2014"
		}
	],
	"Projects":[
		{
			"title":"Mentorship",
			"tags":["Swift"],
			"desc":"Developed a simple IOS Game to motivate students to learn Computer Science. Created a series of Youtube Videos and a Github Repo for students to follow along. Developed using Swift and SpriteKit.",
			"link":"https://github.com/vatsalvora/butterflychaseios"
		},
		{
			"title":"Gita (Alexa Skill)",
			"tags":["Node.js","AWS"],
			"desc":"Developed an Alexa Skill for the Amazon Echo devices using the Node.js SDK for the Alexa Skills Kit. Programmed Alexa to sing verses from the Bhagavad Gita. Worked with the framework to program intents and grab user data into slots. Programmed a Microservice on AWS lambda, hosted audio files on AWS S3, configured logs on AWS CloudWatch, and stored session data on AWS DynamoDB.",
			"link":"https://github.com/vatsalvora/GitaAlexaSkill"
		},
		{
			"title":"QuickSend",
			"tags":["Chrome Extension"],
			"desc":"An application that allows you to send web links to your friends directly from the web page. You can now share links without ever leaving the webpage. You share the link through a Facebook Message or a Chrome Notification. Used Javascript, Graph API, and Google Cloud Messaging.",
			"link":"https://github.com/HCI-Quick-Send"
		},
		{
			"title":"Hotspot",
			"tags":["Web","iOS","Android","Node.js"],
			"desc":"Developed a multi-platform application for geo-location based chat groups using Android, iOS, Java, Node.js, MySQL, and Javascript. Created a REST API to transfer data between platforms. Integrated Facebook and Google authentication for secure login.",
			"link":"https://github.com/Drop-it-Like-its-HotSpot"
		},
		{
			"title":"Gift Recommendation System",
			"tags":["Facebook Application"],
			"desc":"Developed a Facebook App for a Gift Recommendation System using data mining techniques. Integrated Facebook authentication for secure login. System was developed using Graph API, JavaScript, JQuery, Ajax, PHP, Amazon AWS, Linux.",
			"link":"https://github.com/vatsalvora/giftrecfb"
		},
		{
			"title":"Wish Lists",
			"tags":["Android"],
			"desc":"Developed an Android App for sharing Wish Lists in a SCRUM environment as a part of a 5 member team. Used Android, Java, MySQL, and Facebook’s Graph API. Integrated Facebook authentication for secure login.",
			"link":"https://github.com/vatsalvora/WishList"
		},
		{
			"title":"SIS",
			"tags":["Java","Swing"],
			"desc":"Developed a student information system using Java, Java Swing Interface, Oracle, and JDBC for students to access grades, register for courses, and update personal information.",
			"link":""
		},
		{
			"title":"Restaurant Reservation System",
			"tags":["Java","Swing"],
			"desc":"Developed a restaurant reservation system in a 24 hour hackathon to text customers when their seat is open. Built the system using Java Swing, MySQL and the Google Voice API.",
			"link":""
		}
	],
	"Certifications":[
		{
			"title":"AWS Certified Data Analytics Speciality",
			"dates":"March 2021"
		},
		{
			"title":"AWS Certified Solutions Architect - Professional",
			"dates":"June 2020"
		},
		{
			"title":"AWS Certified Developer - Associate",
			"dates":"July 2017"
		}
	],
	"Skills":["Cassandra","Elasticsearch","Spark","Scala","AWS", "AWS Step Functions", "AWS EMR", "AWS DataPipeline", "React","Spring","Java","J2EE","JavaScript","Python","PHP","Oracle","Teradata","MongoDB","MySQL","Storm/Trident","Kafka","Matlab","R","SQL","Git","Maven","Node.js","Android","AWS Lambda","Facebook API","Google API"],
	"Personal":["US Citizen","Reading","Biking","Learning","New Technology","Community/Cultural Work"]
}