{
	"Info":
	{
		"name":"Vatsal Vora",
		"desc":"AWS Certified Developer - Associate | Full Stack Developer",
		"address":"10275 Estuary Drive Tampa, FL 33647",
		"number":"(813) 388-0312",
		"email":"vatsalajvora@gmail.com",
		"linkedin":"https://www.linkedin.com/in/vatsal-vora/",
		"github":"https://www.github.com/vatsalvora"
	},
	"Summary": ["Software Engineering Professional with a strong academic background and industry experience working in US and India. Quick learner with an insatiable appetite for learning new technical skills. Experience working in a startup and corporate environment. Developed applications on mobile and web platforms. Experienced in developing Cloud based solutions. Strong analytic and technical problem solving skills."],
	"Experience":[
		{
			"company":"The Nielsen Company",
			"location":"Tampa, FL",
			"title":"Software Developer",
			"dates":"Sept 2017 - Present",
			"desc":" Worked on updating the UI framework using React and Material UI. Collaborated with a development and UX team in an Agile development environment to have multiple React modules work in unison. Created a library of reusable React Components. Created a REST service with the Java Spring framework and ASPOSE to export data and charts to Microsoft Excel."
		},
		{
			"company":"CGS Infotech Solutions",
			"location":"Mumbai, India",
			"title":"Technology Consultant",
			"dates":"July 2015 - June 2017",
			"desc":" Worked on the Automated Interactive Managed Customer Assistance & Response (AIM-CAR) system, a voice-activated customer response app that provides real time conversation with customers. Developed the system using Node.js, Amazon Lambda, and the Alexa Skills Kit. Developed a system for live videography using a 360 degree camera and integrate Virtual Reality content into websites, social media, iOS and Android applications. Developed applications on the iOS and Android platforms. Web development with Javascript, PHP, and HTML5."
		},
		{
			"company":"JPMorgan Chase",
			"location":"Tampa, FL",
			"title":"Summer Technology Analyst Application Developer",
			"dates":"June 2014 - Aug 2014",
			"desc":"Worked on the Automated Clearing House payments project. Configured a Continuous Integration Server with Jenkins to alert the development team when a bad commit to a Subversion repository broke the build. Configured a Maven build for a multi-modal project. Wrote Scripts for three different Operating Systems (Windows, Unix and Mainframe). Performed regression testing on multiple Java applications."
		},
		{
			"company":"Sears Holding Corporation [MetaScale]",
			"location":"San Jose, CA",
			"title":"Analytics Applications Engineer Intern",
			"dates":"June 2013 - Aug 2013",
			"desc":"Developed a real time analytics application using predictive modeling to analyze and predict trends in the incoming high volume data flow of retail revenue. Developed the application using Java J2EE, Teradata, MongoDB, and open source libraries such as Apache Maven, Storm, Trident and Kafka."
		}
	],
	"Education": [
		{
			"degree": "Master's in Computer Science",
			"institution": "University of Florida",
			"dates": "August 2014 - May 2015"
		},
		{
			"degree": "Bachelor's in Computer Science Engineering",
			"institution": "University of Florida",
			"dates": "Aug 2011 - Dec 2014"
		}
	],
	"Projects":[
		{
			"title":"Gita (Alexa Skill)",
			"tags":["Node.js","AWS"],
			"desc":"Developed an Alexa Skill for the Amazon Echo devices using the Node.js SDK for the Alexa Skills Kit. Programmed Alexa to sing verses from the Bhagavad Gita. Worked with the framework to program intents and grab user data into slots. Programmed a Microservice on AWS lambda, hosted audio files on AWS S3, configured logs on AWS CloudWatch, and stored session data on AWS DynamoDB.",
			"link":"https://github.com/vatsalvora/GitaAlexaSkill"
		},
		{
			"title":"QuickSend",
			"tags":["Chrome Extension"],
			"desc":"An application that allows you to send web links to your friends directly from the web page. You can now share links without ever leaving the webpage. You share the link through a Facebook Message or a Chrome Notification. Used Javascript, Graph API, and Google Cloud Messaging.",
			"link":"https://github.com/HCI-Quick-Send"
		},
		{
			"title":"Hotspot",
			"tags":["Web","iOS","Android","Node.js"],
			"desc":"Developed a multi-platform application for geo-location based chat groups using Android, iOS, Java, Node.js, MySQL, and Javascript. Created a REST API to transfer data between platforms. Integrated Facebook and Google authentication for secure login.",
			"link":"https://github.com/Drop-it-Like-its-HotSpot"
		},
		{
			"title":"Gift Recommendation System",
			"tags":["Facebook Application"],
			"desc":"Developed a Facebook App for a Gift Recommendation System using data mining techniques. Integrated Facebook authentication for secure login. System was developed using Graph API, JavaScript, JQuery, Ajax, PHP, Amazon AWS, Linux.",
			"link":"https://github.com/vatsalvora/giftrecfb"
		},
		{
			"title":"Wish Lists",
			"tags":["Android"],
			"desc":"Developed an Android App for sharing Wish Lists in a SCRUM environment as a part of a 5 member team. Used Android, Java, MySQL, and Facebook’s Graph API. Integrated Facebook authentication for secure login.",
			"link":"https://github.com/vatsalvora/WishList"
		},
		{
			"title":"SIS",
			"tags":["Java","Swing"],
			"desc":"Developed a student information system using Java, Java Swing Interface, Oracle, and JDBC for students to access grades, register for courses, and update personal information.",
			"link":""
		},
		{
			"title":"Restaurant Reservation System",
			"tags":["Java","Swing"],
			"desc":"Developed a restaurant reservation system in a 24 hour hackathon to text customers when their seat is open. Built the system using Java Swing, MySQL and the Google Voice API.",
			"link":""
		}
	],
	"Certifications":[
		{
			"title":"AWS Certified Developer - Associate",
			"dates":"July 2017"
		}
	],
	"Skills":["AWS", "Angular.js","React","Spring","Java","J2EE","JavaScript","Python","PHP","Oracle","Teradata","MongoDB","MySQL","Storm/Trident","Kafka","Matlab","R","SQL","Git","Maven","Node.js","Android","AWS Lambda","Facebook API","Google API"],
	"Personal":["US Citizen","Reading","Biking","Learning","New Technology","Community/Cultural Work"]
}